//
//  Comment.swift
//  VK
//
//  Created by Михаил Чудаев on 27.07.2021.
//

import Foundation


/*
Вынес загрузку в dispatchGroup, все отрабатывает,
 - но вопрос такой интересный:
 На данный момент не догнал как отобразить лайки и комменты, они сделаны control ( папка Button ).
 Пробовал отобразить лайки в самом commentButton ( папка Button ) но добраться до лайков из запроса не получается. Думал сделать по типу загрузки картинки в ячейку но тоже добраться не получается.
 А отобразить в NewsTableViewController тоже не получается. Что-то не так делаю походу.. Думал сделать по типу загрузки картинки в ячейку но тоже добраться не получается.
 
 Вообщем пару вопросов остаются актуальными - это обработка ! при загрузке и вот появился вопрос про отображение лайков и комментов
 
 Помогите пожалуйста разобраться)
 Заранее благодарю)
 

 
 */
