//
//  Comment.swift
//  VK
//
//  Created by Михаил Чудаев on 27.07.2021.
//

import Foundation


/*

Вообщем по дз к 6 уроку,пытался разобраться с версткой фреймами, но опять проблема с опциональным разворачиванием.
 Я для теста сделал 2 контроллера в сториборде, сейчас проект запускает только их ( поставил is initial) , они в самом верху в сториборде
 
 Сделал папку optimizacion для этого, там прописал код.
 Но при запуске вылетает что значение опционал, файл FriendImageCollectionViewCell функция infoLabelFrame
 строчка 83, 85
 // let infoLabelSize = getLabelSize(text: friendInfoLabel.text!, font: friendInfoLabel.font)
 пробовал распоковать через ?? "" но все равно вылетает
 Такая же остория с функцией ameLabelFrame() тоже опционал
 
 Не понимаю откуда там опционал берется

 
 */
